app/Controllers/AdminController.php

SELECT *
FROM `patients`
---
    public function managePatients()
    {
        $model = new PatientModel();
        $data['title'] = 'Patients';
        $data['patients'] = $model->findAll();

SELECT *
FROM `doctors`
---
    public function manageDoctors()
    {
        $model = new DoctorModel();
        $data['title'] = 'Doctors';

        $data['doctors'] = $model->findAll();

SELECT *
FROM `inspectionschedules`
---
    public function manageInspectionSchedules()
    {
        $model = new InspectionScheduleModel();
        $data['title'] = 'Inspection Schedules';

        $data['inspection_schedules'] = $model->findAll();