app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'doctor1@example.com'
 LIMIT 1
---
    public function login()
    {
        $userModel = new UserModel();
        $data = $this->request->getJSON(true);


        $user = $userModel->where('email', $data['email'])->first();