app/Controllers/Doctors.php

SELECT *
FROM `doctors`
---
    public function index()
    {
        // Get parameters sent by DataTables
        $doctorModel = new DoctorModel();

        if (isset($_GET['all']) && $_GET['all'] == '1') {
            $doctors = $doctorModel->findAll();