app/Controllers/Patients.php

    public function index()
    {
        // Get parameters sent by DataTables
        $patientModel = new PatientModel();

        if (isset($_GET['all']) && $_GET['all'] == '1') {
            $patient = $patientModel->findAll();

            return $this->respond(['data' => $patient]);
        }

        $draw = $this->request->getVar('draw');
        $start = $this->request->getVar('start');
        $length = $this->request->getVar('length');
        $searchValue = $this->request->getVar('search')['value'];

        // Query the database

        // Count all records
        $totalRecords = $patientModel->countAll();
---
SELECT *
FROM `patients`
SELECT COUNT(*) AS `numrows` FROM `patients`

                ->orLike('medical_record', $searchValue)
                ->countAllResults();
        } else {
            $patients = $patientModel->findAll($length, $start);
---
SELECT *
FROM `patients`
 LIMIT 10